package homework_04.task_04;

public class Oracle {

/*
Задание 4
Зайдите на сайт Oracle. Используя поисковые механизмы Oracle,
найдите самостоятельно описание темы по каждому примеру, который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые ресурсы»,
описания данного урока. Сохраните ссылки и дайте им короткое описание.

Interfaces
https://docs.oracle.com/javase/tutorial/java/IandI/createinterface.html

Abstract Methods and Classes
https://docs.oracle.com/javase/tutorial/java/IandI/abstract.html


Возможность использования абстрактных классов, если какое-либо из этих утверждений применимо к ситуации:
--Вы хотите разделить код между несколькими тесно связанными классами.
--Вы ожидаете, что классы, которые расширяют ваш абстрактный класс, имеют много общих методов или полей или требуют модификаторов доступа, отличных от общедоступных (таких как protected и private).
--Вы хотите объявить нестатические или неконечные поля. Это позволяет вам определять методы, которые могут получать доступ и изменять состояние объекта, которому они принадлежат.

Возможность использования интерфейсов, если какое-либо из этих утверждений применимо к ситуации:
--Вы ожидаете, что несвязанные классы будут реализовывать ваш интерфейс. Например, интерфейсы Comparableи Cloneable реализуются многими несвязанными классами.
--Вы хотите указать поведение определенного типа данных, но не заботитесь о том, кто реализует его поведение.
--Вы хотите воспользоваться преимуществами множественного наследования типов.

 */

}
